STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_Coap_MultiBoard/STM32_WPAN/App/app_thread.c
    error=otCoapMessageInitResponse(pOT_MessageResponse,
        pMessage,
        OT_COAP_TYPE_ACKNOWLEDGMENT,
        OT_COAP_CODE_CHANGED);

    error = otCoapSendResponse(NULL, pOT_MessageResponse, pMessageInfo);
    if (error != OT_ERROR_NONE && pOT_MessageResponse != NULL)
    {
      otMessageFree(pOT_MessageResponse);
      APP_THREAD_Error(ERR_THREAD_DATA_RESPONSE,error);
    }
  }while(false);

  /* Warn the user of the reception of a COAP request */
  APP_DBG(" ********* Schedule the task TASK_Notif_CoapReceived\r\n");
  UTIL_SEQ_SetTask(TASK_Notif_CoapReceived,CFG_SCH_PRIO_1);
}

/**
 * @brief  This function is used to identify the board and
 *         associate a specific IP address.
 *         If the user presses one time on the SW3 button of the Nucleo board,
 *         this board will have the ID number 1
 *         If the user presses two times on the SW3 button of the Nucleo board,
 *         this board will have the ID number 2
 *         If the user presses N times on the SW3 button of the Nucleo board,
 *         this board will have the ID number N.
 *
 * @param  Mess: Message associated to the error.
 * @param  ErrCode: Error code associated to the module (OpenThread or other module if any)
 * @retval None
 */
static void APP_THREAD_IdentifyBoard()
{
  int  i;

  if (IdBoard < C_NB_BOARD_MAX)
  {
    /* Remove the previous Ip address registered */
    if (IdBoard != 0)
      APP_THREAD_AllocateUnicastIpAddr(IdBoard, FALSE);
    IdBoard ++;

    for (i = 0; i< IdBoard; i++)
    {
      BSP_LED_On(LED1);
      HAL_Delay(200U);
      BSP_LED_Off(LED1);
      HAL_Delay(200U);
    }
    if (otThreadGetDeviceRole(NULL) == OT_DEVICE_ROLE_LEADER)
    {
      NbBoardConnected = IdBoard;
    }
    /* Add the new Ip Address registered  */
    APP_THREAD_AllocateUnicastIpAddr(IdBoard, TRUE);
  }
}

/**
 * @brief This function is used to allocate the unicast Ip address to a dedicated
 *        board.
 *
 * @param boardId : Board identifier
 * @param flagNewIpAdd : Set to TRUE, in order to allocate a new Ip address to a board.
 *               Set to FALSE, in order to remove a previously allocated Ip address to a
 *               board.
 * @retval None
 */
static void APP_THREAD_AllocateUnicastIpAddr(uint8_t boardId, uint8_t flagNewIpAdd)
{
  /* Prepare the IPV6 address */

  if (boardId > C_NB_BOARD_MAX)
  {
    APP_THREAD_Error(ERR_THREAD_IP_ADDR_ALLOC, 0);
  }

  if (otIp6AddressFromString(OT_IpAdressAllocated[(boardId - 1U)], &OT_NetIfAddress.mAddress) != OT_ERROR_NONE)
    APP_THREAD_Error(ERR_THREAD_IP_ADDR_CONVERT, 0);

  if (flagNewIpAdd == TRUE)
  {
    OT_NetIfAddress.mPrefixLength = 64U;
    OT_NetIfAddress.mPreferred=true;
    OT_NetIfAddress.mValid=true;

    APP_DBG(" ********* Allocate_Specific_IpAdress = %s \r\n",OT_IpAdressAllocated[(boardId-1)]);
    /* Add the IP address to the list */
    if (otIp6AddUnicastAddress(NULL,&OT_NetIfAddress) != OT_ERROR_NONE)
      APP_THREAD_Error(ERR_THREAD_ADD_UNICAST, 0);
  }
  else
  {
    /* It may happen that this function returns an error, because the IpddAddr doesn't exist */
    error=otIp6RemoveUnicastAddress(NULL,&OT_NetIfAddress.mAddress);
  }
}

/**
 * @brief This function manages the data response handler
 *        and reschedules the sending of data.
 *
 * @param pHeader  header
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @param Result
 * @retval None
 */
static void APP_THREAD_CoapRespHandler(void                * pContext,
    otMessage           * pMessage,
    const otMessageInfo * pMessageInfo,
    otError               result)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pMessage);
  UNUSED(pMessageInfo);

  if (result == OT_ERROR_NONE)
  {
    APP_DBG(" ********* The COAP has been well acknowledged with error = %d\r\n", result);
  }
  else
  {
    APP_THREAD_Error(ERR_THREAD_RESPONSE_HANDLER, result);
  }
}

/**
 * @brief  Warn the user that a COAP request has been
 *         received
 *
 * @param  Mess: Message associated to the error.
 * @param  ErrCode: Error code associated to the module (OpenThread or other module if any)
 * @retval None
 */
static void APP_THREAD_NotifCoapMsgReceived()
{
  /* Toggle the LED 1 */
  BSP_LED_On(LED1);
  HAL_Delay(500U);
  BSP_LED_Off(LED1);
  HAL_Delay(500U);
  BSP_LED_On(LED1);
  HAL_Delay(500U);
  BSP_LED_Off(LED1);
  HAL_Delay(500U);

  /* Schedule the next COAP.. */
  HAL_Delay(2000U);
  UTIL_SEQ_SetTask(TASK_SEND_BUFFER,CFG_SCH_PRIO_1);
}
/* USER CODE END FD_LOCAL_FUNCTIONS */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

void APP_THREAD_RegisterCmdBuffer(TL_CmdPacket_t* p_buffer)
{
  p_thread_otcmdbuffer = p_buffer;
}

Thread_OT_Cmd_Request_t* THREAD_Get_OTCmdPayloadBuffer(void)
{
  return (Thread_OT_Cmd_Request_t*)p_thread_otcmdbuffer->cmdserial.cmd.payload;
}

Thread_OT_Cmd_Request_t* THREAD_Get_OTCmdRspPayloadBuffer(void)
{
  return (Thread_OT_Cmd_Request_t*)((TL_EvtPacket_t *)p_thread_otcmdbuffer)->evtserial.evt.payload;
}

Thread_OT_Cmd_Request_t* THREAD_Get_NotificationPayloadBuffer(void)
{
  return (Thread_OT_Cmd_Request_t*)(p_thread_notif_M0_to_M4)->evtserial.evt.payload;
}

static void Ot_Cmd_Transfer_Common(void)
{

  /* OpenThread OT command cmdcode range 0x280 .. 0x3DF = 352 */
  p_thread_otcmdbuffer->cmdserial.cmd.cmdcode = 0x280U;
  /* Size = otCmdBuffer->Size (Number of OT cmd arguments : 1 arg = 32bits so multiply by 4 to get size in bytes)
   * + ID (4 bytes) + Size (4 bytes) */
  uint32_t l_size = ((Thread_OT_Cmd_Request_t*)(p_thread_otcmdbuffer->cmdserial.cmd.payload))->Size * 4U + 8U;
  p_thread_otcmdbuffer->cmdserial.cmd.plen = l_size;

  TL_OT_SendCmd();

  /* Wait completion of cmd */
  Wait_Getting_Ack_From_M0();

}

/**
 * @brief  This function is used to transfer the Ot commands from the
 *         M4 to the M0.
 *
 * @param   None
 * @return  None
 */
void Ot_Cmd_Transfer(void)
{
  Ot_Cmd_Transfer_Common();
}

/**
 * @brief  This function is used to transfer the Ot commands from the
 *         M4 to the M0 with Notification M0 to M4 allowed.
 *
 * @param   None
 * @return  None
 */
void Ot_Cmd_TransferWithNotif(void)
{
  /* Flag to specify to UTIL_SEQ_EvtIdle that M0 to M4 notifications are allowed */
  g_ot_notification_allowed = 1U;

  Ot_Cmd_Transfer_Common();
}

/**
 * @brief  This function is called when acknowledge from OT command is received from the M0+.
 *
 * @param   Otbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_OT_CmdEvtReceived( TL_EvtPacket_t * Otbuffer )
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Otbuffer);

  Receive_Ack_From_M0();

  /* Does not allow OpenThread M0 to M4 notification */
  g_ot_notification_allowed = 0U;
}

/**
 * @brief  This function is called when notification from M0+ is received.
 *
 * @param   Notbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_THREAD_NotReceived( TL_EvtPacket_t * Notbuffer )
{
  p_thread_notif_M0_to_M4 = Notbuffer;

